[
	{
		"channel": "release",
		"versionNumber": "4.25.0623",
		"description": "<h3>New:</h3>\r\n- <b>Fuzzy Jyutping:</b> You may not be as familiar with Jyutping as you would like. Fuzzy Jyutping helps with that! When enabled, you can type \"gum yut\" and still find 今日. This feature can be toggled in settings, or by using the keyboard shortcut ⌘ + Shift + J / Ctrl + Shift + J.\r\n- <b>Fuzzy Pinyin:</b> A similar feature now exists for Pinyin as well. This feature can be toggled in settings, or by using the keyboard shortcut ⌘ + Shift + P / Ctrl + Shift + P.\r\n- <b>Search by voice (Windows and Mac only):</b> Click on the microphone icon in the search bar to search by dictation! This feature on macOS is fully supported. On Windows, the dictation system is a little wobbly, so it may take a few tries to get the input to work. Language support depends on language packs installed on your system, but can support Cantonese, Mandarin, English, and French. This feature can also be activated using the keyboard shortcut ⌘ + D / Ctrl + D.\r\n- <b>Search by handwriting:</b> Click on the handwriting icon in the search bar to search by handwriting! Both traditional and simplified characters are supported. This feature can also be activated using the keyboard shortcut ⌘ + K / Ctrl + K.\r\n- <b>Wikipedia Article Titles as new source:</b> Translations for many proper nouns and recent events is now available via the Wikipedia source - head over to the <a href=\"https://jyutdictionary.com/#download-program\" rel=\"nofollow\">Jyut Dictionary website</a> to download!\r\n- <b>Online version:</b> Jyut Dictionary is now also available as a website! Check it out at: <a href=\"https://jyutdictionary.com/\" rel=\"nofollow\">https://jyutdictionary.com</a>.\r\n<h3>Fixes and Improvements:</h3>\r\n- <b>Linux audio fixes:</b> The new version uses a different audio backend to pronounce entries in the dictionary. It's worked on testing across Pop!_OS 22.04 and Fedora 39/42, and should support a much wider spectrum of Linux distros.\r\n<br>- <b>Search history fixes:</b> When language auto-detection is turned on, searches are now persisted in search history.\r\n<h3>Notes:</h3>\r\n- <b>Linux dependency:</b> <b>You must install libharfbuzz on your system for the AppImage to work.</b> This can be done with `sudo dnf install harfbuzz-devel` on Fedora or `sudo apt install libharfbuzz-dev` on Ubuntu.\r\n<br>- <b>Windows 7 and 8 support:</b> Support for Windows 7 and 8 has been dropped. Those operating systems have not been supported by Microsoft for quite some years now. The build system has also moved to Qt 6, which drops support for Windows 7 and 8.",
		"links": [
			{
				"arch": ["arm64"],
				"kernel": "darwin",
				"minOSVersionNumber": "15.0",
				"updateLink": "https://github.com/aaronhktan/jyut-dict/releases/download/v4.25.0623-release/Jyut-Dictionary_4.25.0623_macOS_64bit_install.dmg",
				"variant": "install"
			},
			{
				"arch": ["arm64"],
				"kernel": "darwin",
				"minOSVersionNumber": "15.0",
				"updateLink": "https://github.com/aaronhktan/jyut-dict/releases/download/v4.25.0623-release/Jyut-Dictionary_4.25.0623_macOS_64bit_portable.zip",
				"variant": "portable"
			},
			{
				"arch": ["x86_64"],
				"kernel": "linux",
				"minOSVersionNumber": "0",
				"updateLink": "https://github.com/aaronhktan/jyut-dict/releases/download/v4.25.0623-release/Jyut-Dictionary_4.25.0623_Linux_64bit_appimage.tar.bz2",
				"variant": "appimage"
			},
			{
				"arch": ["x86_64"],
				"kernel": "winnt",
				"minOSVersionNumber": "10",
				"updateLink": "https://github.com/aaronhktan/jyut-dict/releases/download/v4.25.0623-release/Jyut-Dictionary_4.25.0623_Windows_64bit_install.exe",
				"variant": "install"
			},
			{
				"arch": ["x86_64"],
				"kernel": "winnt",
				"minOSVersionNumber": "10",
				"updateLink": "https://github.com/aaronhktan/jyut-dict/releases/download/v4.25.0623-release/Jyut-Dictionary_4.25.0623_Windows_64bit_portable.zip",
				"variant": "portable"
			}
		]
	}
]